## Pandas Tutorial


# Series

Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index.

The first main data type we will learn about for pandas is the Series data type. Let's import Pandas and explore the Series object.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. 

Let's explore this concept through some examples:

pandas.Series
A pandas Series can be created using the following constructor −

* pandas.Series( data, index, dtype, copy)

In [369]:
!pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-1.4.31-cp38-cp38-win_amd64.whl (1.6 MB)
Collecting greenlet!=0.4.17
  Downloading greenlet-1.1.2-cp38-cp38-win_amd64.whl (101 kB)
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-1.1.2 sqlalchemy-1.4.31

In [1]:
import numpy as np
import pandas as pd

In [358]:
print(pd.__version__)

1.3.4

In [8]:
s = pd.Series()
# s = pd.Series(dtype=np.int32)
s

C:\Users\prabh\AppData\Local\Temp/ipykernel_16180/1140532583.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s = pd.Series()

Series([], dtype: float64)

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [8]:
data = np.array(['a','b','c','d'])
s = pd.Series(data)
s

0    a
1    b
2    c
3    d
dtype: object

In [9]:
labels = ['a','b','c','d'] # Using Lists
my_list = [10,20,30,40]
arr = np.array([10,20,30,40]) # array
d = {'a':10,'b':20,'c':30,'d':40} # dictionary

In [10]:
d

{'a': 10, 'b': 20, 'c': 30, 'd': 40}

In [11]:
arr

array([10, 20, 30, 40])

In [12]:
labels ,my_list

(['a', 'b', 'c', 'd'], [10, 20, 30, 40])

In [13]:
pd.Series(data=my_list)

0    10
1    20
2    30
3    40
dtype: int64

In [14]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
d    40
dtype: int64

In [15]:
pd.Series(my_list,labels)

a    10
b    20
c    30
d    40
dtype: int64

In [16]:
pd.Series(arr) # NumPy Arrays

0    10
1    20
2    30
3    40
dtype: int32

In [17]:
pd.Series(arr,labels)

a    10
b    20
c    30
d    40
dtype: int32

In [18]:
pd.Series(d) #  Dictionary

a    10
b    20
c    30
d    40
dtype: int64

### Data in a Series

A pandas Series can hold a variety of object types:

In [19]:
pd.Series(data=labels)

0    a
1    b
2    c
3    d
dtype: object

In [20]:
# Even functions (although unlikely that you will use this)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [21]:
series1 = pd.Series([1,2,3,4],index = ['BMW', 'Volvo','Ford', 'Audi'])

In [22]:
series1

BMW      1
Volvo    2
Ford     3
Audi     4
dtype: int64

In [23]:
series2 = pd.Series([1,2,5,4],index = ['BMW', 'Volvo','Nano', 'Audi'])

In [24]:
series2

BMW      1
Volvo    2
Nano     5
Audi     4
dtype: int64

In [25]:
series1['BMW']

1

In [26]:
series1 + series2

Audi     8.0
BMW      2.0
Ford     NaN
Nano     NaN
Volvo    4.0
dtype: float64

### Create an Empty Series
A basic series, which can be created is an Empty Series.

In [27]:
s = pd.Series()
print(s)

Series([], dtype: float64)

<ipython-input-27-893de6a9497a>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s = pd.Series()

In [28]:
s = pd.Series(5, index=[0, 1, 2, 3]) # Create a Series from Scalar
print(s)

A Pandas Series is like a column in a table.

## Accessing Data from Series with Position
Data in the series can be accessed similar to that in an ndarray.

In [31]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

#retrieve the first element
s['a']

1

In [32]:
#retrieve the first three element
s[:3]

a    1
b    2
c    3
dtype: int64

In [33]:
#retrieve the last three element
s[-3:]

c    3
d    4
e    5
dtype: int64

In [34]:
#retrieve multiple elements
s[['a','c','d']]

a    1
c    3
d    4
dtype: int64

In [35]:
s[['c','a','d']]

c    3
a    1
d    4
dtype: int64

# DataFrames

 We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [31]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

In [29]:
mydataset

In [30]:
pd.DataFrame(mydataset)

A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

### pandas.DataFrame
A pandas DataFrame can be created using the following constructor −

 pandas.DataFrame( data, index, columns, dtype, copy)

In [98]:
from numpy.random import randn
np.random.seed(101)

In [99]:
df = pd.DataFrame(randn(5,4),index=['A','B','C','D', 'E'],columns=['W', 'X', 'Y', 'Z'])

In [100]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Create an Empty DataFrame

In [101]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

### Create a DataFrame from Lists
The DataFrame can be created using a single list or a list of lists.

In [102]:
data = [1,2,3,4,5]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [103]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [104]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)
df

C:\Users\prabh\anaconda3\envs\transorflow_env\lib\site-packages\IPython\core\interactiveshell.py:3444: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  exec(code_obj, self.user_global_ns, self.user_ns)

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

### Create a DataFrame from Dict of ndarrays / Lists

All the ndarrays must be of same length. If index is passed, then the length of the index should equal to the length of the arrays.

If no index is passed, then by default, index will be range(n), where n is the array length.

In [105]:
data = {
    'Name':['Tom', 'Jack', 'Steve', 'Ricky'],
    'Age':[28,34,29,42]}
df = pd.DataFrame(data)
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [106]:
data = {
    'Name':['Tom', 'Jack', 'Steve', 'Ricky'],
    'Age' :[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

### Create a DataFrame from List of Dicts
List of Dictionaries can be passed as input data to create a DataFrame. The dictionary keys are by default taken as column names.

In [107]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [108]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data, index=['first', 'second'])
df

        a   b     c
first   1   2   NaN
second  5  10  20.0

### Create a DataFrame from Dict of Series
Dictionary of Series can be passed to form a DataFrame. The resultant index is the union of all the series indexes passed.

In [109]:
d = {
    'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
    'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [110]:
df = pd.DataFrame(randn(5,4),index=['A','B','C','D', 'E'],columns=['W', 'X', 'Y', 'Z'])

In [111]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

## Selection and Indexing

In [32]:
df['W']

In [33]:
# Pass a list of column names
df[['W','Z']]

In [34]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

In [35]:
type(df['W'])

### Creating a new column:

In [119]:
df['new'] = df['W'] + df['Y']

In [36]:
df

### Removing Columns

In [121]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [122]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [123]:
df.drop('new',axis=1,inplace=True)

In [126]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [125]:
# Can also drop rows
df.drop('E',axis=0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [127]:
# Selecting Rows
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [128]:
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [129]:
#  Selecting subset of rows and columns
df.loc['B','Y']

0.16690463609281317

In [130]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

Slice Rows

Multiple rows can be selected using ‘ : ’ operator

In [84]:

# d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
#    'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

# df = pd.DataFrame(d)
# df[2:4]

In [131]:
## Addition of Rows
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
# df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

# df = df.append(df2)
# df

In [132]:
df

   a  b
0  1  2
1  3  4

In [133]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])
df2

   a  b
0  5  6
1  7  8

In [134]:
df = df.append(df2)

In [135]:
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

## Deletion of Rows
Use index label to delete or drop rows from a DataFrame. If label is duplicated, then multiple rows will be dropped.

If you observe, in the above example, the labels are duplicate. Let us drop a label and will see how many rows will get dropped.

In [136]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
# df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

# df = df.append(df2)

# # Drop rows with label 0
# df = df.drop(0)
# df

In [137]:
df

   a  b
0  1  2
1  3  4

In [138]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])
df2

   a  b
0  5  6
1  7  8

In [139]:
df = df.append(df2)
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [140]:
df = df.drop(0)

In [141]:
df

   a  b
1  3  4
1  7  8

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [142]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [146]:
df = pd.DataFrame(randn(5,4),index=['A','B' ,'C' ,'D' ,'E'], columns=['W', 'X', 'Y', 'Z'])

In [37]:
df

In [38]:
df>0

In [39]:
df[df>0]

In [40]:
df[df['W']>0]

In [41]:
df[df['W']>0]['Y']

In [152]:
df[df['W']>0][['Y','X']]

          Y         X
A -0.376519  2.084019
B -0.031160  1.035125
E -1.046780  1.192241

For two conditions you can use | and & with parenthesis:

In [154]:
df[(df['W']>0) | (df['Y'] < 0)]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [155]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  0.386030  2.084019 -0.376519  0.230336
1     B  0.681209  1.035125 -0.031160  1.939932
2     C -1.005187 -0.741790  0.187125 -0.732845
3     D -1.382920  1.482495  0.961458 -2.141212
4     E  0.992573  1.192241 -1.046780  1.292765

In [157]:
newind = 'CA NY WY OR CO'.split()

In [158]:
df['States'] = newind

In [159]:
df

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     WY
D -1.382920  1.482495  0.961458 -2.141212     OR
E  0.992573  1.192241 -1.046780  1.292765     CO

In [160]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125 -0.031160  1.939932
WY     -1.005187 -0.741790  0.187125 -0.732845
OR     -1.382920  1.482495  0.961458 -2.141212
CO      0.992573  1.192241 -1.046780  1.292765

In [161]:
df

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     WY
D -1.382920  1.482495  0.961458 -2.141212     OR
E  0.992573  1.192241 -1.046780  1.292765     CO

In [162]:
df.set_index('States',inplace=True)

In [163]:
df

               W         X         Y         Z
States
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125 -0.031160  1.939932
WY     -1.005187 -0.741790  0.187125 -0.732845
OR     -1.382920  1.482495  0.961458 -2.141212
CO      0.992573  1.192241 -1.046780  1.292765

## Multi-Index and Index Hierarchy

In [164]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [165]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [166]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -1.467514 -0.494095
   2 -0.162535  0.485809
   3  0.392489  0.221491
G2 1 -0.855196  1.541990
   2  0.666319 -0.538235
   3 -0.568581  1.407338

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [169]:
df.loc['G1']

          A         B
1 -1.467514 -0.494095
2 -0.162535  0.485809
3  0.392489  0.221491

In [170]:
df.loc['G1'].loc[1]

A   -1.467514
B   -0.494095
Name: 1, dtype: float64

In [171]:
df.index.names

FrozenList([None, None])

In [172]:
df.index.names = ['Group','Num']

In [173]:
df

                  A         B
Group Num
G1    1   -1.467514 -0.494095
      2   -0.162535  0.485809
      3    0.392489  0.221491
G2    1   -0.855196  1.541990
      2    0.666319 -0.538235
      3   -0.568581  1.407338

In [174]:
df.xs('G1')

            A         B
Num
1   -1.467514 -0.494095
2   -0.162535  0.485809
3    0.392489  0.221491

In [175]:
df.xs(['G1',1])

C:\Users\prabh\AppData\Local\Temp/ipykernel_16180/580597333.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A   -1.467514
B   -0.494095
Name: (G1, 1), dtype: float64

In [176]:
df.xs(1,level='Num')

              A         B
Group
G1    -1.467514 -0.494095
G2    -0.855196  1.541990

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [202]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [203]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [204]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [205]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [206]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [207]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [208]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [209]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [210]:
df.groupby('Team')

In [211]:
# view Group
df.groupby('Team').groups

{'Devils': [2, 3], 'Kings': [4, 6, 7], 'Riders': [0, 1, 8, 11], 'Royals': [9, 10], 'kings': [5]}

In [95]:
# Group by with multiple columns

In [212]:
df.groupby(['Team','Year']).groups

{('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('Kings', 2016): [6], ('Kings', 2017): [7], ('Riders', 2014): [0], ('Riders', 2015): [1], ('Riders', 2016): [8], ('Riders', 2017): [11], ('Royals', 2014): [9], ('Royals', 2015): [10], ('kings', 2015): [5]}

Iterating through Groups

In [213]:
grouped = df.groupby('Year')

In [214]:
grouped

In [215]:
for name,group in grouped:
    print(name)
    print(group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

### Select a Group

Using the get_group() method, we can select a single group.

In [218]:
grouped = df.groupby('Year')
grouped.get_group(2014)

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [219]:
grouped.mean()

      Rank  Points
Year
2014   2.5  795.25
2015   2.5  769.50
2016   1.5  725.00
2017   1.5  739.00

In [220]:
df.groupby('Team').mean()

            Rank         Year      Points
Team
Devils  2.500000  2014.500000  768.000000
Kings   1.666667  2015.666667  761.666667
Riders  1.750000  2015.500000  762.250000
Royals  2.500000  2014.500000  752.500000
kings   4.000000  2015.000000  812.000000

In [221]:
grouped.std()

          Rank     Points
Year
2014  1.290994  87.439026
2015  1.290994  65.035888
2016  0.707107  43.840620
2017  0.707107  69.296465

In [222]:
grouped.min()

        Team  Rank  Points
Year
2014  Devils     1     701
2015  Devils     1     673
2016   Kings     1     694
2017   Kings     1     690

In [223]:
grouped.max()

        Team  Rank  Points
Year
2014  Royals     4     876
2015   kings     4     812
2016  Riders     2     756
2017  Riders     2     788

In [224]:
grouped.count()

      Team  Rank  Points
Year
2014     4     4       4
2015     4     4       4
2016     2     2       2
2017     2     2       2

In [225]:
grouped.describe()

      Rank                                           Points          \
     count mean       std  min   25%  50%   75%  max  count    mean
Year
2014   4.0  2.5  1.290994  1.0  1.75  2.5  3.25  4.0    4.0  795.25
2015   4.0  2.5  1.290994  1.0  1.75  2.5  3.25  4.0    4.0  769.50
2016   2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0    2.0  725.00
2017   2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0    2.0  739.00


            std    min    25%    50%     75%    max
Year
2014  87.439026  701.0  731.0  802.0  866.25  876.0
2015  65.035888  673.0  760.0  796.5  806.00  812.0
2016  43.840620  694.0  709.5  725.0  740.50  756.0
2017  69.296465  690.0  714.5  739.0  763.50  788.0

# Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating. In this lecture we will discuss these 3 methods with examples.

In [255]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [256]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [257]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [258]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [259]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [260]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

**pd.concat(objs,axis=0,join='outer',join_axes=None,ignore_index=False)**

In [261]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [262]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [263]:
one = pd.DataFrame({
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5'],
   'Marks_scored':[98,90,87,69,78]},
   index=[1,2,3,4,5])

two = pd.DataFrame({
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5'],
   'Marks_scored':[89,80,79,97,88]},
   index=[1,2,3,4,5])
# pd.concat([one,two],keys=['x','y'])

In [264]:
one

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78

In [265]:
two

    Name subject_id  Marks_scored
1  Billy       sub2            89
2  Brian       sub4            80
3   Bran       sub3            79
4  Bryce       sub6            97
5  Betty       sub5            88

In [266]:
pd.concat([one,two],keys=['x','y'])

       Name subject_id  Marks_scored
x 1    Alex       sub1            98
  2     Amy       sub2            90
  3   Allen       sub4            87
  4   Alice       sub6            69
  5  Ayoung       sub5            78
y 1   Billy       sub2            89
  2   Brian       sub4            80
  3    Bran       sub3            79
  4   Bryce       sub6            97
  5   Betty       sub5            88

In [267]:
pd.concat([one,two],keys=['x','y'],ignore_index=True)

     Name subject_id  Marks_scored
0    Alex       sub1            98
1     Amy       sub2            90
2   Allen       sub4            87
3   Alice       sub6            69
4  Ayoung       sub5            78
5   Billy       sub2            89
6   Brian       sub4            80
7    Bran       sub3            79
8   Bryce       sub6            97
9   Betty       sub5            88

In [268]:
pd.concat([one,two],axis=1)

     Name subject_id  Marks_scored   Name subject_id  Marks_scored
1    Alex       sub1            98  Billy       sub2            89
2     Amy       sub2            90  Brian       sub4            80
3   Allen       sub4            87   Bran       sub3            79
4   Alice       sub6            69  Bryce       sub6            97
5  Ayoung       sub5            78  Betty       sub5            88

In [269]:
one.append(two)

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [270]:
# append function can take multiple objects as well −
one.append([two,one,two])

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

## Example DataFrames

In [271]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [272]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [273]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [274]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [275]:
# complicated example
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [276]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [277]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [278]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [279]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [280]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [281]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [128]:
## more example merge

In [282]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})
# left
right

   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [283]:
left

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5

### Merge Two DataFrames on a Key

In [284]:
pd.merge(left,right,on='id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

### Merge Two DataFrames on Multiple Keys

In [285]:
pd.merge(left,right,on=['id','subject_id'])

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

In [286]:
# Left Join
pd.merge(left, right, on='subject_id', how='left')

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   5.0  Betty

In [287]:
# right Join
pd.merge(left, right, on='subject_id', how='right')

   id_x  Name_x subject_id  id_y Name_y
0   2.0     Amy       sub2     1  Billy
1   3.0   Allen       sub4     2  Brian
2   NaN     NaN       sub3     3   Bran
3   4.0   Alice       sub6     4  Bryce
4   5.0  Ayoung       sub5     5  Betty

In [288]:
# outer join
pd.merge(left, right, how='outer', on='subject_id')

   id_x  Name_x subject_id  id_y Name_y
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   4.0  Bryce
4   5.0  Ayoung       sub5   5.0  Betty
5   NaN     NaN       sub3   3.0   Bran

In [289]:
# inner join
pd.merge(left, right, on='subject_id', how='inner')

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     4   Alice       sub6     4  Bryce
3     5  Ayoung       sub5     5  Betty

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [325]:
df = pd.DataFrame({'col1':[1,2,3,4,5,6],'col2':[444,555,666,444,444,555],'col3':['abc','def','ghi','xyz','pqr','hij']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
4     5   444  pqr

In [327]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
4     5   444  pqr
5     6   555  hij

In [326]:
df.tail()

   col1  col2 col3
1     2   555  def
2     3   666  ghi
3     4   444  xyz
4     5   444  pqr
5     6   555  hij

## Info on Unique Values

In [328]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [331]:
df['col2'].nunique()

3

In [332]:
df['col2'].value_counts()

444    3
555    2
666    1
Name: col2, dtype: int64

In [333]:
df.values

array([[1, 444, 'abc'],
       [2, 555, 'def'],
       [3, 666, 'ghi'],
       [4, 444, 'xyz'],
       [5, 444, 'pqr'],
       [6, 555, 'hij']], dtype=object)

## Selecting Data

In [334]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [335]:
newdf

   col1  col2 col3
3     4   444  xyz
4     5   444  pqr

## Applying Functions

In [336]:
def times2(x):
    return x*2

In [337]:
df['col1'].apply(times2)

0     2
1     4
2     6
3     8
4    10
5    12
Name: col1, dtype: int64

In [338]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
4    3
5    3
Name: col3, dtype: int64

In [339]:
df['col1'].sum()

21

In [340]:
## Permanently Removing a Column
del df['col1']

In [341]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz
4   444  pqr
5   555  hij

In [342]:
## Get column and index names
df.columns

Index(['col2', 'col3'], dtype='object')

In [343]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [344]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz
4   444  pqr
5   555  hij

In [345]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
4   444  pqr
1   555  def
5   555  hij
2   666  ghi

In [348]:
# Find Null Values or Check for Null Values
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
5  False  False

In [349]:
# Drop rows with NaN Values
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz
4   444  pqr
5   555  hij

Input from CSV

In [353]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

 Input from Excel

In [365]:
pd.read_excel('Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [366]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [367]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [371]:
from sqlalchemy import create_engine

In [376]:
engine = create_engine('sqlite:///:memory:')

In [377]:
df.to_sql('data', engine)

In [378]:
sql_df = pd.read_sql('data',con=engine)

In [379]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

In [380]:
# list of name, degree, score
nme = ["aparna", "pankaj", "sudhir", "Geeku"]
deg = ["MBA", "BCA", "M.Tech", "MBA"]
scr = [90, 40, 80, 98]
   
# dictionary of lists 
dict = {'name': nme, 'degree': deg, 'score': scr} 
     
df = pd.DataFrame(dict)
  
# saving the dataframe
df.to_csv('file1.csv')

In [381]:
df = pd.read_csv('file.csv')
df

   Unnamed: 0    name  degree  score
0           0  aparna     MBA     90
1           1  pankaj     BCA     40
2           2  sudhir  M.Tech     80
3           3   Geeku     MBA     98

In [382]:
df = pd.DataFrame([[11, 21, 31], [12, 22, 32], [31, 32, 33]],
                  index=['one', 'two', 'three'], columns=['a', 'b', 'c'])

print(df)

        a   b   c
one    11  21  31
two    12  22  32
three  31  32  33

In [383]:
df.to_excel('pandas_to_excel.xlsx', sheet_name='new_sheet_name')

In [384]:
df

        a   b   c
one    11  21  31
two    12  22  32
three  31  32  33